Revit 2024 API
BuiltInFailures.KeynoteTagFailures.NoKeynoteAssignedToLinkedElement Property
 The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoKeynoteAssignedToLinkedElement { get; }
Visual Basic
Public Shared ReadOnly Property NoKeynoteAssignedToLinkedElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoKeynoteAssignedToLinkedElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeynoteTagFailures Class
Autodesk.Revit.DB Namespace